# 十六进制用0x -- 0xff00
# 整数和浮点数在计算机内部存储的方式是不同的，整数运算永远是精确的（除法难道也是精确的？是的！），而浮点数运算则可能会有四舍五入的误差。
# 字符串用''或者""表示，如果内部含有'或者"，使用转义符\'或者\"。如果要很多转义，可以使用r''，表示内部字符串默认不转义，用""""""格式化很多行内容(可用r"""""")
# 布尔值True/False可以和and or not一起
# 空值 None
if __name__ == '__main__':
    print(12.345e5)  # 1234500.0
    print(12.345e-5)  # 0.00012345
    print(1 / 3)
    print(r'\n\t\\')  # \n\t\
    print("""\ta
    b
    c""")
    print(True or False)  # True
    # 变量名必须是大小写英文、数字和_的组合，且不能用数字开头
    a, b = 1, 2
    print(a, b)
    a, b = b, a  # 互换值
    print(a, b)
    # 常量就是不能变的变量，在Python中，通常用全部大写的变量名表示常量
    PI = 3.1415926
    print(PI)
    # python有两种除法/(结果一定是浮点数，精确)&//(地板除，整数相除，结果取整)
    print(9 / 3)  # 3.0
    print(5 // 3)  # 1
    print(5.0 // 3)  # 1.0
    # 注意：Python的整数，浮点数没有大小限制。但是超出一定范围就直接表示为inf