if __name__ == '__main__':
    print(list(range(10)))  # [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
    a = [1, 2, 3, 4, 5, 6]
    # 拿前三个数据
    print(a[0:3])  # [1, 2, 3]
    print(a[:3])  # [1, 2, 3]
    print(a[2:])  # [3, 4, 5, 6]
    print(a[:])  # [1, 2, 3, 4, 5, 6] 复制
    # 支持倒数切片
    print(a[-2:])  # [5, 6]
    # 每n个数取一个
    print(list(range(10))[::2])  # [0, 2, 4, 6, 8]
    # tuple也是一种list，唯一区别是tuple不可变。因此，tuple也可以用切片操作，只是操作的结果仍是tuple
    print((1, 2, 3, 4, 5, 6)[1:3])  # (2, 3)
    # 字符串'xxx'也可以看成是一种list，每个元素就是一个字符。因此，字符串也可以用切片操作，只是操作结果仍是字符串
    print("ABCDEFG"[::2])  # ACEG
